In [1]:
import pandas as pd

In [2]:
lb = pd.read_csv('./Datasets/labour_force.csv')
lb

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,PRT,LF,MEN,THND_PER,A,1960,2791.0000,NaN
1,PRT,LF,MEN,THND_PER,A,1974,2259.0000,NaN
2,PRT,LF,MEN,THND_PER,A,1975,2378.0000,NaN
3,PRT,LF,MEN,THND_PER,A,1976,2481.0000,NaN
4,PRT,LF,MEN,THND_PER,A,1977,2477.0000,NaN
...,...,...,...,...,...,...,...,...
33512,CRI,LF,WOMEN,THND_PER,Q,2021-Q4,971.8831,NaN
33513,CRI,LF,WOMEN,THND_PER,Q,2022-Q1,985.6275,NaN
33514,CRI,LF,WOMEN,THND_PER,Q,2022-Q2,979.6945,NaN
33515,CRI,LF,WOMEN,THND_PER,Q,2022-Q3,996.9903,NaN
33516,CRI,LF,WOMEN,THND_PER,Q,2022-Q4,993.4783,NaN

In [3]:
lb.columns = lb.columns.str.lower()

In [4]:
for col in lb.keys():
    lb[col]
    print(col,lb[col].isnull().values.any())

location False
indicator False
subject False
measure False
frequency False
time False
value False
flag codes True

In [5]:
lb.nunique()

location         45
indicator         1
subject           3
measure           1
frequency         3
time           1157
value         31390
flag codes        2
dtype: int64

In [124]:
group = lb[(lb['frequency']=='A')]
print(group.shape)
group = group[group['subject']=='TOT']
print(group.shape)
# group = group.groupby(by=['location','time']).sum()

(5574, 8)
(1962, 8)

In [141]:
group

,location,indicator,subject,measure,frequency,time,value,flag codes
1725,MEX,LF,TOT,THND_PER,A,2005,43631.500,NaN
1726,MEX,LF,TOT,THND_PER,A,2006,44982.520,NaN
1727,MEX,LF,TOT,THND_PER,A,2007,45904.540,NaN
1728,MEX,LF,TOT,THND_PER,A,2008,46769.210,NaN
1729,MEX,LF,TOT,THND_PER,A,2009,48018.360,NaN
...,...,...,...,...,...,...,...,...
33350,CRI,LF,TOT,THND_PER,A,2018,2359.644,NaN
33351,CRI,LF,TOT,THND_PER,A,2019,2464.956,NaN
33352,CRI,LF,TOT,THND_PER,A,2020,2406.532,NaN
33353,CRI,LF,TOT,THND_PER,A,2021,2440.771,NaN
33354,CRI,LF,TOT,THND_PER,A,2022,2454.023,NaN

In [76]:
# group.to_csv("./group.csv")

In [77]:
# group = pd.read_csv("./group.csv")
# group

     location  time       value
0         AUS  1964    4559.964
1         AUS  1965    4814.342
2         AUS  1966    4891.618
3         AUS  1967    5022.656
4         AUS  1968    5140.392
...       ...   ...         ...
1957      USA  2018  162075.000
1958      USA  2019  163538.700
1959      USA  2020  160742.300
1960      USA  2021  161203.900
1961      USA  2022  164287.200

[1962 rows x 3 columns]

In [156]:
min_year = 2001
# int(group['time'].min())
max_year = int(group['time'].max())
sorted_cont = group['location'].unique()
sorted_cont.sort()
for cont in sorted_cont:
    years = []
    for y in range(min_year,max_year):
#         print(group[group['location']==cont]['time'].astype("string"))
        if (str(y) not in group[group['location']==cont]['time'].astype("string").values):
            years.append(y)
    if len(years)!=0:
        print(cont, years)
#         print(cont,y,group[group['location']==cont]['time'])

BRA [2001, 2002, 2015, 2016, 2017, 2018, 2019, 2020, 2021]
CHE [2001, 2002, 2003, 2004]
COL [2001, 2002, 2003, 2004, 2005, 2006]
CRI [2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010]
IDN [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021]
LTU [2001, 2002, 2003, 2004]
MEX [2001, 2002, 2003, 2004]
OECD [2001, 2002, 2003, 2004, 2005, 2006]
TUR [2001, 2002, 2003, 2004, 2005]

In [159]:
group.drop(['indicator','subject','measure','frequency','flag codes'],axis=1,errors='ignore')

      location  time      value
1725       MEX  2005  43631.500
1726       MEX  2006  44982.520
1727       MEX  2007  45904.540
1728       MEX  2008  46769.210
1729       MEX  2009  48018.360
...        ...   ...        ...
33350      CRI  2018   2359.644
33351      CRI  2019   2464.956
33352      CRI  2020   2406.532
33353      CRI  2021   2440.771
33354      CRI  2022   2454.023

[1962 rows x 3 columns]